/***
 * $Source$
 * $Revision$ $Date$
 *
 * Created: Thu Oct  5 04:01:31 1995
 * System:  Linux tularosa 1.1.52 #1 Fri Oct 14 20:18:11 CDT 1994 i486
 *
 * This program was created by cdbl 1.64 using the command line:
 *	$ cd /home/ldl/dbl/cdbl
 *	$ ../bin/cdbl -t subs.dbl 
 *
 * Environment variables (when created):
 *	ignoreeof=10
 *	LOGNAME=ldl
 *	MINICOM=-c on
 *	MAIL=/var/spool/mail/ldl
 *	TERM=console
 *	HOSTTYPE=i386
 *	PATH=/usr/local/bin:/usr/bin:/bin:/usr/bin/X11:/usr/TeX/bin:/usr/openwin/bin:/usr/games:.:~ldl/dbl/bin:/usr/local/src/linuxdoc-sgml/bin
 *	HOME=/home/ldl
 *	SHELL=/bin/sh
 *	MANPATH=/usr/man:/usr/man/preformat:/usr/X11/man:/usr/openwin/man
 *	LESS=-MM
 *	MAKEFLAGS=
 *	OPENWINHOME=/usr/openwin
 *	_=../bin/cdbl
 *	SHLVL=2
 *	MAKELEVEL=1
 *	BASH=/bin/sh
 *	MFLAGS=
 */

#include <stdio.h>
#include <cdbl/cdbl_rt.h>

struct
  {
    char    EXPR[25];                                   /* A25       	*/
    char    __1[2];                                     /* A2        	*/
    char    I_GOT[40];                                  /* A40       	*/
  }       GOT
= { /* GOT */
					/* EXPR                         */
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    ' ', ' ', ' ', ' ', ' ',
					/* __1                          */
    '=', ' ',
					/* I_GOT                        */
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
  };
struct
  {
    char    __2[25];                                    /* A25       	*/
    char    __3[2];                                     /* A2        	*/
    char    WANTED[40];                                 /* A40       	*/
  }       WANT
= { /* WANT */
					/* __2                          */
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    ' ', 'w', 'a', 'n', 't',
					/* __3                          */
    ' ', ' ',
					/* WANTED                       */
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
  };
struct
  {
    char    DFLD[8];                                    /* D8        	*/
    char    AFLD[13];                                   /* A13       	*/
    char    MFLD[3][2][3];                              /* A3        	*/
  }       ABS
= { /* ABS */
					/* DFLD                         */
    '1', '0', '2', '0', '3', '4', '0', '5',
					/* AFLD                         */
    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J',
    'K', 'L', 'M',
					/* MFLD                         */
    'A', 'B', 'C',
    'D', 'E', 'F',
    'G', 'H', 'I',
    'J', 'K', 'L',
    'M', 'N', 'O',
    'P', 'Q', 'R',
  };
struct
  {
    char    ALPHA[3][4];                                /* D4        	*/
    char    BETA[6];                                    /* A6        	*/
    char    GAMMA[3];                                   /* D3        	*/
    char    DELTA[4][2];                                /* A2        	*/
  }       DEMO
= { /* DEMO */
					/* ALPHA                        */
    '0', '0', '0', '3',
    '9', '8', '7', '6',
    '4', '3', '2', '1',
					/* BETA                         */
    'A', 'B', 'C', 'D', 'E', 'F',
					/* GAMMA                        */
    '5', '4', '5',
					/* DELTA                        */
    'L', 'M',
    'N', 'P',
    'R', 'S',
    'T', 'V',
  };
#ifndef MAX_CALL_STACK
#define MAX_CALL_STACK 100
#endif/*MAX_CALL_STACK*/

static
void
call_push(__call_return, __call_stack, lab)		/* Function	*/
  int       __call_return[];
  int      *__call_stack;
  int       lab;
{
  if (*__call_stack >= MAX_CALL_STACK)
    drt_FATAL("CALL stack overflow");
  __call_return[++(*__call_stack)] = lab;
}


/* --------------------------------------------------------------------	*/
/*    Note: The #line directives point to the "end" of the statement.	*/
